refactor:clean code - write backend-md
